{"0":"Meaning ","1":"It is good to stay humble and remember your origins","2":"You can tell someone is a fool by their actions","3":"Pay attention to what people do not what they say","4":"Success is determined by how you start","5":"To gain knowledge, one must consistently study","6":"You cannot gain anything by sitting around talking about it. You must get up and work for it.","7":"Look for the cause of a problem and not the symptoms","8":"It is easy for a person to get into trouble when he or she is not busy doing something.","9":"If we want to reach the top of our respective goals, we will need to put in the work","10":"When powerful forces go to war, it's their people who are hurt. Those who never asked for the conflict in the first place are caught, and killed, in the crossfire.","11":"Our actions in the present determine if we achieve our goals in the future","12":"Hatred is a complex and powerful emotion that can be incredle to overcome","13":"Something good will come out of a difficult situation","14":"Someone that plans harm or misfortune for others may also inadvertently be the recipient of that same misfortune.","15":"Always be on your guard and do not let yourself be taken advantage of by anyone or anything. ","16":"No matter how difficult or dark the current circumstances may seem, there is always the promise of a better future ahead.","17":"Even when we help others, they may not always be grateful and may take advantage of our kindness","18":"A person hurt in a situation remembers, whereas the person who hurt the other, forgets.","19":"Experiences in life deepen our appreciation for things we often overlook.","20":"Just because someone has been successful at doing something does not mean you will be successful at doing the same thing.","21":"Don't be discouraged when you fail, as long as you are. doing something. Use failure as a driving force to push. you forward.","22":"Don't mistake hearsay from the truth.","23":"Material possessions are not as important as life itself.","24":"With the right preparatory work and conditions, a difficult task can become much easier.","25":"It is important to choose trustworthy friends.","26":"Doing your best is sufficient.","27":"Engaging in meaningful conversations and exchanging ideas can be as valuable as wealth or material riches.","28":"Always be aware of your surroundings and different situations.","29":"A good leader should first learn how to follow orders in order to be successful.","30":"Approach things with a calm and open mindset.","31":"No matter what the situation, it's always better to tell the truth.","32":"Regardless of our differences, we all share a common origin and destiny.","33":"Trouble comes to everyone at one point or another.","34":"Always remember your roots and respect your traditions no matter where you are.","35":"Even the most seemingly insignificant beings can make quite a difference to someone. ","36":"Our greatest enemy is often ourselves.","37":"The experiences that deeply affect us emotionally are remembered vividly and lastingly.","38":"Greatness is earned through effort, not inherited at birth.","39":"When an elder passes away, valuable knowledge is lost forever.","40":"Genuine love and truth are intertwined and inseparable.","41":"Marrying for wealth may lead to loss, but the undesirable traits remain.","42":"Love illuminates and dispels darkness.","43":"Being loved brings greater happiness than being feared.","44":"Love transforms obstacles into opportunities.","45":"True love accepts imperfections without judgment.","46":"Patience is the cure for love's challenges.","47":"Unrequited love is futile and unrewarding.","48":"Focus on the love you have, not on what you lack.","49":"Love remains steadfast even amid change.","50":"Love is indiscriminate and falls where it may.","51":"Treat your loved ones with respect and consistency.","52":"Love is deaf to gossip and hears only the truth.","53":"True love values both the container and its contents.","54":"If someone loves or appreciates something superficial, they also value what is deeper or more meaningful.","55":"Marrying for love alone may bring challenges during the day, but intimacy and connection at night.","56":"When someone is deeply attached or infatuated with something, they may overlook its faults or fail to hear criticism.","57":"Love should be gentle and gradual but have a powerful and transformative effect over time.","58":"Disagreements and conflicts between lovers can ultimately strengthen their relationship by resolving issues and fostering understanding.","59":"Trying to turn someone against the person they love will only create resentment towards you, not diminish their love for the other person.","60":"If a woman doesn't have romantic feelings for a man, she may consider him only as a friend or brother.","61":"Love can be powerful and controlling, affecting everyone regardless of their status or position.","62":"Love is not dependent on physical appearance; it goes beyond superficial features.","63":"If someone makes you laugh, it doesn't necessarily mean they love you; laughter can have various motivations.","64":"While you may know who you love, it's difficult to know who loves you in return.","65":"Love can provide comfort and relief from pain.","66":"Finding happiness in the person you marry brings greater fulfillment than simply marrying someone you love.","67":"Pursuing superficial things can lead to common problems and challenges.","68":"Many people prioritize wealth over other qualities when choosing a partner.","69":"While various forms of love exist, self-love is the most important.","70":"True love involves sharing and sacrifice.","71":"The pain of a broken heart can be worse than physical injury.","72":"Actions speak louder than words when it comes to demonstrating love.","73":"Sometimes, physical differences can complicate expressions of love.","74":"Love doesn't hide vulnerabilities or flaws.","75":"Love can change one's perception of the world, making challenges seem less daunting.","76":"Wisdom is valuable and can lead to success.","77":"Wisdom is vast and cannot be fully grasped by one individual.","78":"A wise person listens more than they speak.","79":"Wisdom is acquired over time through experience and reflection.","80":"Wise individuals are calm and tranquil.","81":"Wisdom is shared and spread among people.","82":"Problem-solving often requires wisdom.","83":"Knowledge without understanding or insight is worthless.","84":"In times of crisis, wise individuals find solutions, while fools create further problems.","85":"Pride can hinder the acquisition of wisdom.","86":"Wise individuals find solutions to challenges.","87":"Wisdom is not innate; it's acquired through learning and experience.","88":"A single day of wise decisions can surpass a lifetime of foolishness.","89":"Mistakes can be valuable learning experiences.","90":"The wisdom of others can prevent foolishness.","91":"By the time a fool learns, others may have moved on.","92":"Ignoring facts can lead to unintended consequences.","93":"Proverbs are designed to impart wisdom to those who listen.","94":"Actions don't always indicate agreement or consent.","95":"Wise individuals think before they speak.","96":"Ignorance can be more costly than education.","97":"Your body is a vessel for learning and growth.","98":"A wise person speaks thoughtfully, whereas a fool speaks impulsively.","99":"Wise individuals plan carefully to avoid unnecessary risks.","100":"Adversity can be a powerful teacher.","101":"Words can bring about destruction if spoken carelessly.","102":"Ancestral wisdom is often invaluable.","103":"It's better to take decisive action than to hesitate.","104":"Deeds are more meaningful than words alone.","105":"People have different areas of expertise and knowledge.","106":"Wise individuals learn from their mistakes and don't repeat them.","107":"Family provides support and structure.","108":"Unity within a family is essential for its strength.","109":"Family bonds are resilient but can be flexible.","110":"Harmony within the family is a measure of success.","111":"Cooperation among many leads to success.","112":"Children's development is influenced by their upbringing.","113":"Children often imitate what they see.","114":"Parents aim to provide their children with roots (foundation) and wings (opportunities).","115":"Family members share resources and experiences.","116":"Even those in servitude have familial ties.","117":"Interfering in family disputes can be risky.","118":"Family members are often more concerned about troublesome relatives than the individuals themselves.","119":"Educating women benefits entire families and communities.","120":"A good spouse contributes to the well-being of the family.","121":"Women play a vital role in the household.","122":"Parental influence extends beyond physical attributes.","123":"Every mother sees her child as special.","124":"Community support is essential in raising children.","125":"Even a small space can accommodate many friends.","126":"A husband protects and cherishes his wife.","127":"Parents prioritize the well-being of their offspring.","128":"Collaboration leads to greater achievements than working alone.","129":"Solidarity among people makes them stronger.","130":"Brothers often share a special bond when they are equally successful.","131":"While it's fine to dine with strangers, familial love should be preserved.","132":"Disownment from one's family is a rare occurrence.","133":"Mutual assistance among relatives can mitigate external challenges.","134":"Misfortune affects families collectively.","135":"The elderly care for the young, and vice versa, in a cycle of support.","136":"Family disputes can lead to inheritance issues.","137":"Children are a source of joy and fulfillment.","138":"Private family matters should be kept within the household.","139":"Children respect their parents despite any flaws.","140":"Families should prioritize each other's well-being.","141":"Familial conflicts can be challenging to resolve.","142":"The ruler's actions can influence the entire nation.","143":"Humility is essential for maintaining relationships.","144":"Cooperation and collaboration lead to success.","145":"Learning from past mistakes is important for growth.","146":"Educating children is a communal effort.","147":"Personal experiences shape one's perspective.","148":"Mutual respect is crucial for peaceful coexistence.","149":"Proverbs contain wisdom that can resolve disputes.","150":"Judging by actions is more accurate than judging by words.","151":"Patience and steady progress lead to success.","152":"Rushing often leads to mistakes.","153":"Responding to fire with fire can be effective.","154":"Retaliation in kind is a common response to offense.","155":"Individuals are shaped by their interactions with others.","156":"Collaboration and collective effort yield stronger results.","157":"No one can thrive in isolation.","158":"Progress comes gradually through steady effort.","159":"Intellect is valuable and can improve one's life.","160":"Consistent effort leads to significant achievements.","161":"A journey of a thousand miles begins with a single step.","162":"Anger can lead to negative outcomes.","163":"One's upbringing influences their behavior.","164":"Recognizing patterns is crucial for avoiding mistakes.","165":"Family ties are strong and enduring.","166":"Appearance can be deceptive.","167":"Etiquette is important, especially during meals.","168":"Self-praise is often viewed negatively.","169":"Hard work is necessary for success.","170":"A single lie can discredit numerous truths or undermine trust in vast information.","171":"Understanding comes from direct experience; judgment should be reserved until one has firsthand knowledge.","172":"External influences may impact a person, but they cannot fundamentally change who they are.","173":"Progress takes time, but eventual achievement is certain.","174":"Socio-economic disparities often create divides that hinder social interaction.","175":"Societal problems often stem from issues within individual households or families.","176":"Hatred cannot be easily eradicated or treated with conventional means.","177":"Collective effort can overcome individual strength or advantage.","178":"Perspectives on fortune vary based on individual circumstances.","179":"Wise advisors contribute to effective leadership and stability.","180":"Actions speak louder than words; there's no need to state the obvious.","181":"Wealth brings comfort and the freedom to disregard societal expectations.","182":"A woman prioritizes her family's needs, even when she herself is hungry.","183":"Overconfidence can lead to overlooking potential dangers.","184":"Some individuals lack the insight to understand wisdom without explanation.","185":"Jealousy and disdain often accompany both wealth and poverty.","186":"Children often emulate their parents' behaviors and values.","187":"Once a precedent is set, it's easier to repeat or continue similar actions.","188":"Certain traits or characteristics are evident from an early age.","189":"A mother protects her child from harm, even when she herself is affected.","190":"Experience brings awareness of potential threats or uncomfortable truths.","191":"Showing respect to those in authority or of higher status can lead to personal success.","192":"Pride can shield an individual from the full impact of failure.","193":"Reciprocity is essential for true cooperation and mutual benefit.","194":"Proverbs offer insights that can help resolve conflicts and solve problems.","195":"Focus on identifying the root cause of a problem, rather than dwelling on its immediate effects.","196":"Good habits and hygiene can lead to opportunities for advancement.","197":"Having principles and beliefs prevents being swayed or misled by others.","198":"Parenting and upbringing are collaborative efforts that involve the entire community.","199":"One's appearance or status can mask their humble origins.","200":"It's important to observe proper etiquette to avoid discomfort or mishaps.","201":"Self-praise often stems from a lack of external validation or recognition.","202":"Actions speak louder than words; it's more important to do than to say.","203":"Success favors those who take initiative and assert themselves.","204":"One should remain grateful for assistance or good fortune, rather than becoming arrogant.","205":"Agreement or alignment with one's destiny leads to favorable outcomes.","206":"External conditions or circumstances can inspire action or ambition.","207":"Experience allows one to recognize qualities or attributes without needing further confirmation.","208":"Judging someone by their actions and accomplishments is more accurate than judging by their words.","209":"Progressing steadily and cautiously is better than rushing.","210":"Patience and focus lead to success, while haste leads to mistakes.","211":"Rushing often results in errors and delays.","212":"Sometimes, confronting a problem directly is the best solution.","213":"Responding to an action with a similar action.","214":"Emphasizes the shared humanity among individuals.","215":"Everyone depends on others in some way.","216":"Indicates nearing completion or fullness.","217":"Intelligence is valuable, but applying knowledge is crucial for improvement.","218":"Incremental progress leads to significant achievements.","219":"Every significant accomplishment starts with a small step.","220":"Acting out of anger leads to negative consequences.","221":"Traits or behaviors are often inherited.","222":"Children often resemble their parents.","223":"A single lie undermines credibility.","224":"Don't underestimate a danger until it's fully confronted.","225":"Adversity may affect someone superficially, but it does not change their true character.","226":"Progress may seem slow, but with patience and persistence, significant achievements can be made.","227":"Social classes often remain separate, indicating societal divisions and inequality.","228":"Societal problems often originate from individual behaviors and values within families and communities.","229":"Hatred is a deep-rooted emotion that cannot be easily eliminated or cured.","230":"Unity and cooperation can overcome formidable challenges.","231":"Circumstances that are unfortunate for one person may benefit another, illustrating the subjective nature of fortune.","232":"Wise advisors contribute to effective leadership and stability.","233":"Actions speak louder than words; unnecessary communication can be avoided.","234":"Wealth allows for certain liberties or eccentricities, such as not conforming to societal expectations.","235":"Responsibility for providing for others often takes precedence over personal needs or desires.","236":"Intoxication or unawareness can make someone vulnerable to danger.","237":"Some individuals lack understanding and require explanations for simple truths or sayings.","238":"Jealousy and resentment exist regardless of social or financial status.","239":"Children often adopt the behaviors and values of their parents or role models.","240":"Past experiences make one more susceptible to similar occurrences in the future.","241":"Some individuals exhibit characteristics or potential from a young age.","242":"Parents protect and care for their children, ensuring their safety and well-being.","243":"Certain topics or reminders of mortality can evoke discomfort or anxiety, especially in older individuals.","244":"Showing reverence towards accomplished individuals can inspire personal growth.","245":"Pride can shield someone from the emotional impact of failure or setback.","246":"Mutual cooperation or assistance is natural and reciprocal.","247":"Proverbs hold wisdom that can be applied to resolve conflicts or challenges.","248":"Focus on identifying the cause of a mistake rather than dwelling on the mistake itself.","249":"Proper preparation and behavior can lead to opportunities for success and acceptance.","250":"Having principles or convictions is essential for avoiding manipulation or deception.","251":"Parenting and upbringing are collective responsibilities that involve the entire community.","252":"Appearances can be deceiving; one should not judge solely based on outward impressions.","253":"Certain actions or behaviors should be avoided in specific contexts to prevent mishaps or misunderstandings.","254":"Self-praise may be necessary when recognition from others is lacking.","255":"Actions speak louder than words, and someone who benefits from a situation may remain silent.","256":"Assertiveness and self-respect lead to success and recognition.","257":"Success obtained with the help of others should be acknowledged with humility.","258":"Personal beliefs or convictions influence one's actions and decisions.","259":"Positive circumstances can inspire and motivate individuals, regardless of their limitations.","260":"Experience and intuition allow one to recognize qualities or characteristics without explicit evidence.","261":"Assess someone based on their actions and accomplishments rather than mere appearances or promises.","262":"Proceeding cautiously and steadily is preferable to rushing.","263":"Rushing or impatience often leads to mistakes and negative outcomes.","264":"Rushing leads to inefficiency and mistakes, ultimately slowing progress.","265":"Sometimes, a problem can only be solved by confronting it directly or using a similar approach.","266":"Responding to an action with a similar action.","267":"Emphasizes the shared humanity among individuals.","268":"Everyone depends on others in some way.","269":"Indicates nearing completion or fullness.","270":"Intelligence is valuable, but applying knowledge is crucial for improvement.","271":"Incremental progress leads to significant achievements.","272":"Every significant accomplishment starts with a small step.","273":"Acting out of anger leads to negative consequences.","274":"Traits or behaviors are often inherited.","275":"A child's character or behavior can be expected to resemble that of their parents.","276":"A child usually has a similar character or similar qualities to his or her parents.","277":"It's difficult to change habits once they are established."}